{"Cannot synchronize host [HOSTNAME]. An error occurred while communicating with the remote host.": "⚠️ Etki: vCenter ile host arasındaki bağlantı kopukluğu nedeniyle host yönetimi, izleme ve konfigürasyon senkronizasyonu yapılamaz.\n\nÇözüm Adımları:\n- vCenter UI'da **Home > Hosts and Clusters**'a gidin, host'u (**tandogan01.ocloud.local**) seçin, sağ tıklayın ve **Connection > Disconnect** yapın.\n- ESXi host client'a (https://host-IP/ui) doğrudan login olun, sol panelde **Manage > Services** sekmesine gidin.\n- **hostd** ve **vpxa** servislerini bulun, her birini **Restart** edin (hostd önce).\n- vCenter'da host'u sağ tıklayın ve **Connection > Connect** yaparak yeniden bağlayın.\n- Bağlantı sonrası **Rescan** yapın ve log'ları (**/var/run/log/vpxa.log**) kontrol edin.", "NTP Server value is null!": "⚠️ Etki: NTP sunucusu değeri null olduğu için ESXi host'unda zaman senkronizasyonu sağlanamaz, bu da kümelenme, loglama ve sertifika hatalarına yol açar.\n\nÇözüm Adımları:\n- SSH ile ESXi host'una bağlanın ve `esxcli system ntp get` komutuyla mevcut NTP ayarlarını kontrol edin.\n- NTP sunucularını ekleyin: `esxcli system ntp server add --server=pool.ntp.org` (veya güvenilir NTP sunucularınızı kullanın, birden fazla ekleyebilirsiniz).\n- NTP servisini etkinleştirin: `esxcli system ntp set --enabled=true`.\n- NTP servisini yeniden başlatın: `/etc/init.d/ntpd restart`.\n- Doğrulayın: `ntpq -p` komutuyla senkronizasyonu kontrol edin (Connection refused hatası gitmeli).", "VM has an active snapshot! Restore Point 1-7-2026 7:46:40 AM created on [DATE] [TIME]": "⚠️ Etki: Aktif snapshot VM performansını düşürür, disk alanını hızla tüketir ve yedekleme/replikasyon işlemlerini engeller.\n\nÇözüm Adımları:\n- vSphere Client'ta ilgili VM'ye gidin, Actions > Snapshots > Manage Snapshots seçin ve Delete All ile tüm snapshot'ları silin.\n- Snapshot silinemiyorsa VM'yi başka bir host'a vMotion edin veya host'u yeniden başlatın.\n- Barracuda Backup web arayüzüne giriş yapın, Backup > Schedules sayfasına gidin ve otomatik snapshot silme ayarlarını etkinleştirin/kontrol edin.\n- vCenter'da vSphere Agent Manager servisini kontrol edin: SSH ile host'a bağlanıp `/etc/init.d/vsphere-ui restart` komutunu çalıştırın, ardından 'cluster' servisinin durumunu doğrulayın (`service-control --status cluster`).", "VMware Eski Ağ Kartı: E1000 gibi eski NIC kullanılıyor. VMXNET3'e göre yavaş.": "⚠️ Etki: E1000 NIC kullanımı, VMXNET3'e kıyasla ağ throughput'unu ve performansını önemli ölçüde düşürür, gecikme yaratır.\n\nÇözüm Adımları:\n- VM çalışırken vSphere Client'ta VM ayarlarını düzenleyin, \"Yeni Aygıt Ekle > Ağ Bağdaştırıcısı > VMXNET3\" seçin ve yeni NIC'i bağlı bırakın (Connected unchecked).\n- Mevcut E1000 NIC'inin \"Bağlı\" (Connected) kutusunu kaldırın, VM console'unda yeni VMXNET3 NIC'ine aynı IP yapılandırmasını taşıyın (VMware Tools yüklü olsun).\n- Yeni NIC'i bağlayın (Connected işaretleyin), eski E1000 NIC'ini kaldırın (Remove).\n- Değişiklikleri kaydedin ve VM ağ bağlantısını doğrulayın.", "VMware Eski Snapshot: Snapshot 7 günden eski. Performansı düşürür, disk büyümesine neden olur.": "⚠️ Etki: Eski snapshot'lar disk zincirinde bozulmaya yol açar, performansı düşürür, depolama büyümesine ve yedekleme/replikasyon sorunlarına neden olur.\n\nÇözüm Adımları:\n- vSphere Client'ta VM'ye gidin, Snapshot Manager'ı açın ve snapshot'ı \"Consolidate\" edin.\n- Başarısız olursa VM'yi power off yapın, snapshot'ı silin ve diski consolidate edin.\n- VM'yi yeniden başlatın veya vMotion ile başka host'a taşıyın.\n- vCenter'da VM/host log'larını inceleyin (Disk I/O hataları için xorg, vmkwarning filtreleyin).", "VMware Düşük CPU Kullanımı: vCPU kullanımı sürekli %10'un altında. Fazla vCPU scheduler overhead'i artırır.": "⚠️ Etki: Sürekli düşük vCPU kullanımı (%10 altı), ESXi scheduler overhead'ini artırarak host CPU performansını düşürür ve kaynak israfına yol açar.\n\nÇözüm Adımları:\n- vSphere Client'ta etkilenen VM'lerin CPU kullanımını (Usage ve Ready Time) izleyin ve düşük kullanımda vCPU sayısını azaltın (VM > Edit Settings > CPU).\n- Host'un genel CPU overcommitment oranını kontrol edin (esxcli system resource get | grep cpu), 3:1'den fazla ise VM'leri yeniden dağıtın.\n- Gereksiz vCPU'ları kaldırmak için VM'leri power-off edip hot-add özelliğini devre dışı bırakın.\n- Sorun devam ederse, VM'leri başka host'a vMotion ile taşıyın veya host'u maintenance modda reboot edin.", "VMware EOL İşletim Sistemi: İşletim sistemi artık desteklenmiyor (End-of-Life).": "⚠️ Etki: Destek sona eren ESXi sürümü güvenlik yamaları almayacağı için sistem açıklarına maruz kalır ve yeni vSphere özellikleriyle uyumsuzluk yaşar.\n\nÇözüm Adımları:\n- ESXi host sürümünü kontrol edin: SSH ile `esxcli system version get` komutunu çalıştırın.\n- vSphere Agent Manager'da 'cluster' servisini doğrulayın: vCenter > Host > Actions > Services > vSphere Agent Manager > 'cluster' servisini etkinleştirin/başlatın.\n- VMware Lifecycle Policy'den desteklenen ESXi sürümünü (örn. 8.0U3) seçin ve Compatibility Guide'ı inceleyin.\n- VM'leri ve konfigürasyonu yedekleyin (vCenter Backup veya export).\n- ESXi'yi desteklenen sürüme yükseltin: ISO boot ile upgrade veya vCenter Update Manager kullanın.\n- Yükseltme sonrası health check'leri yeniden çalıştırın ve servisleri doğrulayın."}